КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЗЗ_Титул2/КонтурЛогистика_ЗЗ_Титул2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ЗЗ_Титул2</name>
  <posting>Deny</posting>
  <attributes>
    <name>УИД_Зак</name>
    <comment>Выдается ГИС ЭПД Уникальный идентификатор документа заказа (заявки)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Титул1</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфПрв</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфПрв</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Составитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена информации грузоотправителя</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаимЭкСубСост</name>
    <comment>Наименование экономического субъекта, составляющего файл обмена информации перевозчика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфГО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфГО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПГО</name>
    <comment>Электронная подпись файла обмена информации грузоотправителя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <comment>Признак отказа в подписи</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <comment>Причина отказа в приеме заказа (заявки)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвЛицОргПрвз</name>
    <comment>Сведение о лице, ответственном за организацию перевозки со стороны перевозчика (СвЛицОргПрвз)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СвЛицПрв</name>
    <comment>Сведения о лице, уполномоченном перевозчиком на заполнение и подписание заказа (заявки)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <comment>Транспортное средство</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>СтТовБезНДС</name>
    <comment>Стоимость перевозки без налога – всего</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалСт</name>
    <comment>Ставка НДС</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтТовУчНал</name>
    <comment>Стоимость перевозки с налогом – всего</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расчет</name>
    <comment>Порядок (механизм) расчета (исчислений) платы</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквДоверНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквДоверНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквДоверДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквДоверИдДок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквДоверДопСведДок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквДоверСоставитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквДоверСоставитель2</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Водители</name>
    <attributes>
      <name>СвВодит</name>
      <comment>Сведения о водителе</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Прицепы</name>
    <attributes>
      <name>Прицеп</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>T(1-2000)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СпецУсловияДвижения</name>
    <attributes>
      <name>НомСР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСР</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокСР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СведМрш_МршТекст</name>
      <comment>Установленный маршрут движения тяжеловесного и (или) крупногабаритного транспортного средства или транспортного средства, перевозящего опасный груз</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СведМрш_МршМашЧит</name>
      <comment>Маршрут, машиночитаемый формат</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдСР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаимОИВ</name>
      <comment>Краткое наименование органа исполнительной власти (специализированной уполномоченной организации), выдавшего документ</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
    </type>
  </resources>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ДвижениеДокументооборота/КонтурЛогистика_ДвижениеДокументооборота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ДвижениеДокументооборота</name>
  <comment>время периода по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <comment>kl-status из сервиса: Титул.CustomData</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СостоянияДвиженияДокументооборота</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлОбмена</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ФайлыОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаналТранспорта</name>
    <type>
      <types>EnumRef.КонтурЛогистика_КаналыТранспорта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектронныйЗаказНаряд</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЗЗ_Титул2/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПроверкаОтвета", РежимПроверкиОтвета);
			
	ОбновитьДанныеФормы();
		
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УстановитьЗаголовкиСтраниц();
	
	// нет в реквизитах объекта СуммаНДС - восстановим её
	СуммаНДС = Объект.СтТовУчНал - Объект.СтТовБезНДС;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Баги старой платформы при отрисовке сложных группировок
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Элементы.ГруппаСуммы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Элементы.Декорация2.Видимость = Ложь;
		Элементы.СуммаДляРасчетов.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.СтавкаНДС.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.СуммаНДС.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.СтоимостьБезНДС.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.СтоимостьСНДС.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элементы.СтавкаНДС.РастягиватьПоГоризонтали = Ложь;
	#КонецЕсли
	
	УправлениеВидимостьюИДоступностью();
	ПроверитьДокумент();
	УправлениеВидимостьюСумм(ЭтаФорма);
	
	ЗаполнитьСуммуДляРасчета();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.Титул1, Истина);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена
		 Или ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда
		ПерешелВЛогистическиеСтатус = Истина;
	Иначе
		ПерешелВЛогистическиеСтатус = Ложь;
	КонецЕсли;
		
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Повторно выполнить задачу";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Выполнить задачу";
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, 
																				   Объект.ДокументОснование,
																				   Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, 
																				   ТекущийСтатус);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка 
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки Тогда
		ДоступнаОсновнаяКнопкаПоУмолчанию = Истина;
		ТолькоПросмотр = Ложь;
	Иначе
		ДоступнаОсновнаяКнопкаПоУмолчанию = Ложь;
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	УстановитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию", ДоступнаОсновнаяКнопкаПоУмолчанию);
	
	Если ЗначениеЗаполнено(Объект.Титул1.Грузоотправитель) Тогда
		ГОНаш = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Объект.Титул1.Грузоотправитель, "Наш");
	Иначе
		ГОНаш = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ВвестиЭТРНизЗЗ", ГОНаш);
	
	Если ТекущийСтатусДокументооборота.ТребуемоеДействиеТ1 = Перечисления.КонтурЛогистика_ТребуемыеДействия.ПроверитьОтветДругогоУчастника
		И ГОНаш Тогда
		
		РежимПроверкиОтвета = Истина;
		
	КонецЕсли;
	
	ТолькоПросмотр = Макс(РежимПроверкиОтвета, ТолькоПросмотр);
	
	УстановитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ПроверкаОтветаПройдена",
		Не ДоступнаОсновнаяКнопкаПоУмолчанию И РежимПроверкиОтвета);
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПроверкаОтветаПройдена.КнопкаПоУмолчанию 	= НЕ ДоступнаОсновнаяКнопкаПоУмолчанию И РежимПроверкиОтвета;
	УстановитьВидимостьЭлемента("ПодменюОтказаться", Не ДоступнаОсновнаяКнопкаПоУмолчанию И РежимПроверкиОтвета);
	
	УстановитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ОтказатьсяВПодписи",
		ДоступнаОсновнаяКнопкаПоУмолчанию Или Не РежимПроверкиОтвета);
	
	Элементы.ГруппаОсновныеРеквизиты.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ГруппаСуммы.ТолькоПросмотр				= ТолькоПросмотр;
	Элементы.ДобваитьВторогоВодителя.Доступность	= Не ТолькоПросмотр;
	
	Если Элементы.Найти("ФормаОбщаяКомандаКонтурЛогистика_ОтказатьсяВПодписи") <> Неопределено Тогда
		УстановитьВидимостьЭлемента("ФормаОбщаяКомандаКонтурЛогистика_ОтказатьсяВПодписи", Не ТолькоПросмотр);
	КонецЕсли;
	
	ЭтоВходящий = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен;
	
	УстановитьВидимостьЭлемента("ПользовательПодписант", Не ЭтоВходящий);
	
	РеквизитыТ1 = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(Объект.Титул1, "Составитель,НаимЭкСубСост,ДогОргПрвз");	
	
	СоставительТ1 	= РеквизитыТ1.Составитель;
	НаимЭкСубСостТ1 = РеквизитыТ1.НаимЭкСубСост;
	ДогОргПрвзТ1 	= РеквизитыТ1.ДогОргПрвз;
	
	Т1Товары = Объект.Титул1.Товары;
	Т1Мест 			= Т1Товары.Итог("КоличествоМест");
	Т1МассаБрутто 	= Т1Товары.Итог("МассаПлановаяБруттоКг");
	Т1Объем 		= Т1Товары.Итог("ОбъемКубМ");
	
	ЗаполнитьПоказателиРасчетаСумм(ЭтаФорма);
	СформироватьНадписиПараметровТСИДопУсловий();
	ЗаполитьПолеВводаВодителя(ЭтаФорма);
	ЗаполитьПолеВводаПрицепа(ЭтаФорма);
	
	ЗаполнитьДатыПогрузки();
	
	Элементы.Титул1ДокументШаблон.Видимость = ЗначениеЗаполнено(Объект.Титул1.ДокументШаблон);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлемента(ИмяЭлемента, Видимость)
	
	НайденныйЭлемент = Элементы.Найти(ИмяЭлемента);
	Если НайденныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныйЭлемент.Видимость = Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И Параметр = Объект.Ссылка Тогда 
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьДокументЛогистики" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
				
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПерепроверитьДокумент" Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьДокумент", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
		
	ИначеЕсли ИмяСобытия = "ПерезаполнитьТитул"
		И Параметр <> Неопределено
		И Параметр = Объект.Ссылка Тогда
		
		ПерезаполнитьПоДокОснованиюСервер();
		ЗаполнитьСуммуДляРасчета();
		ПересчитатьСуммы();
		
		ОбновитьДанныеФормы();
		ОбновитьОтображениеДанных();
		ПроверитьДокумент();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи"
			  И Параметр <> Неопределено
			  И ТипЗнч(Параметр) = Тип("Массив")
			  И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда

		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()

	ЭтаФорма.Прочитать();
	ОбновитьФорму();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ОбновитьДанныеФормы();
	ПроверитьДокумент();
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.УправлениеЭлементамиДокументОснование(ЭтаФорма, Объект.ДокументОснование);
	УправлениеКолбасойТитуловВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеКолбасойТитуловВызовСервера()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УправлениеСтатусомПодписиИКолбасойТитулов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()

	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	ЭтоВходящий = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен");
	ЭтоЧерновик = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик");
			
	// причина отказа в подписи 
	
	Элементы.ГруппаПричинаОтказаВПодписи.Видимость = (ЭтоВходящий Или Не ЭтоЧерновик) И Объект.ЕстьОтказВПодписи;	
	
	Элементы.ЗЗ_Титул1Сотставитель.Видимость 	= Не ЭтоВходящий И ЗначениеЗаполнено(СоставительТ1);
	Элементы.ЗЗ_Титул1НаимЭкСубСост.Видимость 	= ЭтоВходящий И ЗначениеЗаполнено(НаимЭкСубСостТ1);
	Элементы.Составитель.Видимость 				= Не ЭтоВходящий;
	Элементы.НаимЭкСубСост.Видимость 			= ЭтоВходящий;
	
	Элементы.ГруппаСтороныЗЗСоставитель.Видимость 	= ЗначениеЗаполнено(СоставительТ1) Или ЗначениеЗаполнено(НаимЭкСубСостТ1);	
	Элементы.ГруппаСтороныЗЗДоговорСПВ.Видимость 	= ЗначениеЗаполнено(ДогОргПрвзТ1);
	
	Элементы.ГруппаЛицоПеревозкиДоверенность.Видимость = ЗначениеЗаполнено(Объект.СвЛицПрв);
	
	Элементы.СвЛицОргПрвз.Видимость 				= Не Объект.ЕстьОтказВПодписи;
	Элементы.ТранспортноеСредство.Видимость 		= Не Объект.ЕстьОтказВПодписи;
	Элементы.ГруппаРазмерПлаты.Видимость 			= Не Объект.ЕстьОтказВПодписи;
	Элементы.ГруппаДоп.Видимость 					= Не Объект.ЕстьОтказВПодписи;
	Элементы.СтраницаВодители.Видимость 			= Не Объект.ЕстьОтказВПодписи;
	Элементы.СтраницаПрицепы.Видимость 				= Не Объект.ЕстьОтказВПодписи;
	Элементы.СтраницаСпецУсловияДвижения.Видимость 	= Не Объект.ЕстьОтказВПодписи;
	Элементы.ГруппаОсновныеРеквизиты.Видимость 		= Не Объект.ЕстьОтказВПодписи;
	
	УказанВторойВодитель = Объект.Водители.Количество() > 1;
	Элементы.ГруппаВодитель2.Видимость = УказанВторойВодитель;
	Элементы.ДобваитьВторогоВодителя.Видимость = Не УказанВторойВодитель;
	
	УправлениеВидимостьюСумм(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);
	
	УправлениеВидимостьюИДоступностью();
	
	Возврат РезультатПроверки;
		
КонецФункции

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ЗаполнитьЧерезНастройкиКонвертации();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ЗЗ_Титул2.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	УстановитьЗаголовкиСтраниц();
	
	Возврат РезультатПроверки;
	
КонецФункции

// Обслуживание панели ошибок
&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПодписантПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТумблерПодписатьИОтправитьПриИзменении(Элемент)
	
	Если Не Объект.ЕстьОтказВПодписи Тогда 
		Объект.ПричинаОтказаВПодписи = "";
	КонецЕсли;	
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоВходящийТитулФормы(Форма)
	
	Возврат Форма.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен")
		Или Форма.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки")
		Или Форма.ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением")
		Или Форма.РежимПроверкиОтвета;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСуммы(Форма)
	
	Объект = Форма.Объект;
	
	Если Форма.НеРассчитыватьСуммы Тогда 			
		
		Объект.СтТовБезНДС 	= Форма.СуммаДляРасчетов;
		Форма.СуммаНДС 		= 0;
		Объект.СтТовУчНал 	= 0;
		
	Иначе
		
		Если Форма.НДСВСумме Тогда 
			
			Если Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС10_110") Тогда 
				Форма.СуммаНДС = Форма.СуммаДляРасчетов * 10 / 110;
			ИначеЕсли Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС20_120") Тогда	
				Форма.СуммаНДС = Форма.СуммаДляРасчетов * 20 / 120;
			ИначеЕсли Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС22_122") Тогда	
				Форма.СуммаНДС = Форма.СуммаДляРасчетов * 22 / 122;
			ИначеЕсли Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС5_105") Тогда	
				Форма.СуммаНДС = Форма.СуммаДляРасчетов * 5 / 105;
			ИначеЕсли Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС7_107") Тогда	
				Форма.СуммаНДС = Форма.СуммаДляРасчетов * 7 / 107;
			КонецЕсли;	
			
			Объект.СтТовУчНал 	= Форма.СуммаДляРасчетов;
			Объект.СтТовБезНДС 	= Объект.СтТовУчНал - Форма.СуммаНДС;
			
		Иначе
			
			Если Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС10") Тогда 
				Форма.СуммаНДС = Форма.СуммаДляРасчетов * 10 / 100;
			ИначеЕсли Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС20") Тогда	
				Форма.СуммаНДС = Форма.СуммаДляРасчетов * 20 / 100;
			ИначеЕсли Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС22") Тогда	
				Форма.СуммаНДС = Форма.СуммаДляРасчетов * 22 / 100;
			ИначеЕсли Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС5") Тогда	
				Форма.СуммаНДС = Форма.СуммаДляРасчетов * 5 / 100;
			ИначеЕсли Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС7") Тогда	
				Форма.СуммаНДС = Форма.СуммаДляРасчетов * 7 / 100;
			ИначеЕсли Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС9_09") Тогда	
				Форма.СуммаНДС = Форма.СуммаДляРасчетов * 9.09 / 100;
			ИначеЕсли Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС16_67") Тогда	
				Форма.СуммаНДС = Форма.СуммаДляРасчетов * 16.67 / 100;
			ИначеЕсли Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС18_03") Тогда	
				Форма.СуммаНДС = Форма.СуммаДляРасчетов * 18.03 / 100;
			КонецЕсли;
			
			Объект.СтТовБезНДС 	= Форма.СуммаДляРасчетов;
			Объект.СтТовУчНал 	= Объект.СтТовБезНДС + Форма.СуммаНДС;
			
		КонецЕсли;	
		
	КонецЕсли;	
		
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостьюСумм(Форма)

	Элементы = Форма.Элементы;
	
	Если ЭтоВходящийТитулФормы(Форма) Тогда
		
		// Входящий: служебные реквизиты формы скрываем, загруженные реквизиты объекта показываем как есть
		Элементы.СуммаДляРасчетов.Видимость = Ложь;
		Элементы.СуммаНДС.Видимость = Ложь;
		Элементы.СтавкаНДС.Видимость = Истина;
		Элементы.СтоимостьБезНДС.Видимость = Истина;
		Элементы.СтоимостьСНДС.Видимость = Истина;
		Элементы.Расчет.Видимость = Истина;
		Возврат;
		
	КонецЕсли;
	
	Элементы.СуммаДляРасчетов.Видимость = Истина;
	
	Если Форма.НеРассчитыватьСуммы Тогда
		
		Элементы.СуммаДляРасчетов.Заголовок = "Сумма без НДС";
		Элементы.СуммаНДС.Заголовок 		= "Сумма НДС";
		
		Элементы.СуммаНДС.Видимость 		= Ложь;
		Элементы.СтоимостьБезНДС.Видимость 	= Ложь;
		Элементы.СтоимостьСНДС.Видимость 	= Ложь;
		
	Иначе
		
		Если Не Форма.НДСВСумме Тогда
			
			Элементы.СуммаДляРасчетов.Заголовок = "Сумма без НДС";
			Элементы.СуммаНДС.Заголовок 		= "Сумма НДС";
			
			Элементы.СуммаНДС.Видимость 		= Истина;
			Элементы.СтоимостьБезНДС.Видимость 	= Ложь;			
			Элементы.СтоимостьСНДС.Видимость 	= Истина;
			
		Иначе
			
			Элементы.СуммаДляРасчетов.Заголовок = "Сумма с НДС";
			Элементы.СуммаНДС.Заголовок 		= "Сумма НДС (в т.ч.)";
			
			Элементы.СуммаНДС.Видимость 		= Истина;
			Элементы.СтоимостьБезНДС.Видимость 	= Истина;			
			Элементы.СтоимостьСНДС.Видимость 	= Ложь;
			
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПоказателиРасчетаСумм(Форма)

	Объект = Форма.Объект;
	
	Форма.НеРассчитыватьСуммы = Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.БезНДС")
							Или Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС0")
							Или Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДСИсчисляетсяНалоговымАгентом");
						
	Форма.НДСВСумме = Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС10_110")
					Или Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС20_120")
					Или Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС22_122")
					Или Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС5_105")
					Или Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС7_107");


КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуДляРасчета()
	
	Если НеРассчитыватьСуммы Тогда
		
		СуммаДляРасчетов = Объект.СтТовБезНДС;
		
		Если СуммаДляРасчетов = 0 Тогда
			 СуммаДляРасчетов = Объект.СтТовУчНал;
		КонецЕсли;	
		
	Иначе
		
		Если НДСВСумме Тогда
			СуммаДляРасчетов = Объект.СтТовУчНал;
		Иначе
			СуммаДляРасчетов = Объект.СтТовБезНДС;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура СуммаДляРасчетовПриИзменении(Элемент)
	
	ПересчитатьСуммы();
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьБезНДСПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьСНДСПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСуммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммы()
	
	Если ЭтоВходящийТитулФормы(ЭтаФорма) Тогда
		ПроверитьДокумент();
		УправлениеВидимостьюСумм(ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоказателиРасчетаСумм(ЭтаФорма);
	РассчитатьСуммы(ЭтаФорма);
	
	ПроверитьДокумент();
	УправлениеВидимостьюСумм(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаНДСПриИзменении(Элемент)
		
	Если СуммаНДС = 0 Тогда 
		
		Объект.НалСт = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.БезНДС");
				
	КонецЕсли;	
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставительПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОснДовОргСостПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура РасчетПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СвЛицПрвПриИзменении(Элемент)
	ОчиститьДанныеДоверенности();
	УправлениеВидимостьюИДоступностью();
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеДоверенности()
	
	Объект.РеквДоверДата 			= Дата(1,1,1);
	Объект.РеквДоверДопСведДок 		= "";
	Объект.РеквДоверИдДок 			= "";
	Объект.РеквДоверНаименование 	= "";
	объект.РеквДоверНомер 			= "";
	Объект.РеквДоверСоставитель 	= ПредопределенноеЗначение("Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка");
	Объект.РеквДоверСоставитель2 	= ПредопределенноеЗначение("Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура РеквДоверИдДокПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура РеквДоверНаименованиеПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура РеквДоверДатаПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура РеквДоверСоставительПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура РеквДоверДопСведДокПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура РеквДоверСоставитель2ПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ЗаполнитьПрицепПоУмолчанию();
	
	ЗаполитьПолеВводаПрицепа(ЭтаФорма);
	
	ПроверитьДокумент();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПрицепПоУмолчанию()
	
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		Объект.Прицепы.Очистить();
		
		ПрицепПоУмолчанию = Объект.ТранспортноеСредство.ПрицепПоУмолчанию;
		ПрицепПоУмолчанию2 = Объект.ТранспортноеСредство.Прицеп2ПоУмолчанию;
		
		Если ЗначениеЗаполнено(ПрицепПоУмолчанию) Тогда 
			НовПрицеп = Объект.Прицепы.Добавить();
			
			НовПрицеп.Прицеп = ПрицепПоУмолчанию;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПрицепПоУмолчанию2) Тогда 
			НовПрицеп = Объект.Прицепы.Добавить();
			
			НовПрицеп.Прицеп = ПрицепПоУмолчанию2;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвЛицОргПрвзПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВодителиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаполитьПолеВводаВодителя(ЭтаФорма);
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ВодителиПослеУдаления(Элемент)
	ЗаполитьПолеВводаВодителя(ЭтаФорма);
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПрицепыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаполитьПолеВводаПрицепа(ЭтаФорма);
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПрицепыПослеУдаления(Элемент)
	ЗаполитьПолеВводаПрицепа(ЭтаФорма);
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СпецУслДвижПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СпецУслДвижПослеУдаления(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура Титул1ПриИзменении(Элемент)
	ОбновитьДанныеФормы();
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовкиСтраниц()
		
	УстановитьЗаголовокСтраницы(Элементы.СтраницаВодители, Объект.Водители.Количество(), "Водители");
	УстановитьЗаголовокСтраницы(Элементы.СтраницаПрицепы, Объект.Прицепы.Количество(), "Прицепы");
	УстановитьЗаголовокСтраницы(Элементы.СтраницаСпецУсловияДвижения, Объект.СпецУсловияДвижения.Количество(), "Спец. условия движения");
	УстановитьЗаголовокСтраницы(Элементы.СтраницаПунктыМаршрутаТ1, Объект.Титул1.АдрПункт.Количество(), "Маршрут");
	
	// грузы с учетом не учитываемых
	КоличествоСтрок = 0;
	Для Каждого ТекущаяСтрока Из Объект.Титул1.Товары Цикл
		Если Не ТекущаяСтрока.Учитывать Тогда
			Продолжить;
		КонецЕсли;
		КоличествоСтрок = КоличествоСтрок + 1;
	КонецЦикла;
	Элементы.СтраницаГрузыТ1.Заголовок = "Грузы (" + КоличествоСтрок + ")";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатыПогрузки()
	
	Если Не ЗначениеЗаполнено(Объект.Титул1) Тогда
		Возврат;
	КонецЕсли;
	
	МестоПогрузки = КонтурЛогистика_СтдОбщегоНазначения.ЗначениеРеквизитаОбъектаЛок(Объект.Титул1, "ПунктПод");
	Если ЗначениеЗаполнено(МестоПогрузки) Тогда
		ЧасовойПоясПогрузки = МестоПогрузки.ЧасовойПояс;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЧасовойПоясПогрузки) Тогда
		Т1ДатаВремяПодачи = КонтурЛогистика_ОбщегоНазначенияСервер.ПривестиКЧасовомуПоясу(
			Объект.Титул1.ДатВрПод, Неопределено, ЧасовойПоясПогрузки);
	Иначе
		Т1ДатаВремяПодачи = Объект.Титул1.ДатВрПод;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЧасовойПоясПогрузки) Тогда
		Элементы.ЧасовойПоясЗаголовок.Заголовок = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПредставлениеЧасовогоПоясаЛок(ЧасовойПоясПогрузки);
	Иначе
		Элементы.ЧасовойПоясЗаголовок.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокСтраницы(Страница, КоличествоСтрок, БазовыйЗаголовок)
	
	Если КоличествоСтрок = 0 Тогда 
		Страница.Заголовок = БазовыйЗаголовок;
	Иначе
		Страница.Заголовок = БазовыйЗаголовок + " (" + КоличествоСтрок + ")";
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере                                                                                                                         
Процедура СформироватьНадписиПараметровТСИДопУсловий()
	
	Титул1 = Объект.Титул1;
	
	Если ЗначениеЗаполнено(Титул1) Тогда 
		
		Реквизиты = "ТСГрузопод,ТСВместим,ТСТип,ТСТипКуз,ТСТипПогр,ТСДрПарам,ТемператураНеВыше,ТемператураНеНиже,
					|ВлажностьНеВыше,ВлажностьНеНиже,УказанияВОтношенииНормПеревозки,ПредСрПрвз,ПрвзПищПрод,ИныеУслв,КонПунктМрш";
	
		СтруктураПоказателей = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(Объект.Титул1, Реквизиты);
		
		Модуль = КонтурЛогистика_ПечатьСервер;
		
		Элементы.Титул1ТСТипПогр.Видимость 	= ЗначениеЗаполнено(Титул1.ТСТипПогр);
		Элементы.Титул1ТСТипКуз.Видимость 	= ЗначениеЗаполнено(Титул1.ТСТипКуз);
		Элементы.Титул1ТСДрПарам.Видимость 	= ЗначениеЗаполнено(Титул1.ТСДрПарам);
		
		ОписаниеДопПолейГО = "Доп. поля Грузоотправителя (не указаны)";
		Если ЗначениеЗаполнено(Титул1.ТемператураНеВыше)
			Или ЗначениеЗаполнено(Титул1.ТемператураНеНиже) Тогда 
			
			ОписаниеДопПолейГО = "Доп. поля Грузоотправителя (указаны)";	
		Иначе
			Элементы.ГруппаТемпература.Видимость = Ложь;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Титул1.ВлажностьНеВыше)
			Или ЗначениеЗаполнено(Титул1.ВлажностьНеНиже) Тогда
			ОписаниеДопПолейГО = "Доп. поля Грузоотправителя (указаны)";	
		Иначе
			Элементы.ГруппаВлажность.Видимость = Ложь;
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Титул1.УказанияВОтношенииНормПеревозки)
			Или (ЗначениеЗаполнено(Титул1.ПредСрПрвз) И Титул1.ПредСрПрвз <> "Отсутствуют")
			Или (ЗначениеЗаполнено(Титул1.ПрвзПищПрод) И Титул1.ПрвзПищПрод <> "Отсутствуют")
			Или ЗначениеЗаполнено(Титул1.ИныеУслв)
			Или ЗначениеЗаполнено(Титул1.КонПунктМрш) Тогда 
			
			ОписаниеДопПолейГО = "Доп. поля Грузоотправителя (указаны)";	
			
		Иначе
			
			
		КонецЕсли;
		
		Элементы.СтраницаДопПоляТ1.Заголовок = ОписаниеДопПолейГО;
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполитьПолеВводаВодителя(Форма)
	
	Если ЗначениеЗаполнено(Форма.Объект.Водители) Тогда 
		Форма.Водитель = Форма.Объект.Водители[0].СвВодит;
		Если Форма.Объект.Водители.Количество() > 1 Тогда 
			Форма.Водитель2 = Форма.Объект.Водители[1].СвВодит;
		Иначе
			Форма.Водитель2 = "";
		КонецЕсли;
	Иначе
		Форма.Водитель = "";
		Форма.Водитель2 = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполитьПолеВводаПрицепа(Форма)
	
	Если ЗначениеЗаполнено(Форма.Объект.Прицепы) Тогда 
		Форма.Прицеп = Форма.Объект.Прицепы[0].Прицеп;
	Иначе
		Форма.Прицеп = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	
	Объект.Водители.Очистить();
	
	Если ЗначениеЗаполнено(Водитель) Тогда 
		НоваяСтрока = Объект.Водители.Добавить();
		НоваяСтрока.СвВодит = Водитель;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Водитель2) Тогда 
		НоваяСтрока = Объект.Водители.Добавить();
		НоваяСтрока.СвВодит = Водитель2;
	КонецЕсли;	
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрицепПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Прицеп) Тогда 
		Если Не ЗначениеЗаполнено(Объект.Прицепы) Тогда
			НоваяСтрока = Объект.Прицепы.Добавить();
			НоваяСтрока.Прицеп = Прицеп;
		Иначе	
			Объект.Прицепы[0].Прицеп = Прицеп;
		КонецЕсли;	
	Иначе
		Объект.Прицепы.Удалить(0);
		ЗаполитьПолеВводаПрицепа(ЭтаФорма);
	КонецЕсли;	
	
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюЗаказЗаявку(Команда)
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("Продолжить (я связался с перевозчиком)");
	Кнопки.Добавить("Отмена");
	
	ТекстВопроса = "В соответствии с правилами обмена электронным заказом(заявкой) не предусмотрен отказ грузоотправителя после подписания перевозчиком титула 2.
	|Обязательно свяжитесь с перевозчиком и сообщите, что собираетесь отправить новый Заказ(Заявку) на замену.
	|
	|При выполнении команды мы пометим документ как завершенный и установим статус ""Отказ ГО. Создана новая заявка"", но перевозчик не получит электронное уведомление о вашем отказе по исходной заявке.
	|
	|Пометить и открыть форму нового повторного Заказа(Заявки)?";
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.Вопрос_КонтурЛогистика(
		ТекстВопроса, Кнопки, , , ЭтаФорма, "СоздатьНовуюЗаказЗаявкуПодтверждение");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюЗаказЗаявкуПодтверждение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> "Продолжить (я связался с перевозчиком)" Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_ЗЗ_Титул1.Форма.ФормаДокумента",
		Новый Структура("Ключ", СсылкаНаНовуюЗаявку(Объект.Титул1)),
		ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СсылкаНаНовуюЗаявку(ЗЗ_Титул1Ссылка)
	
	НовыйОбъект = ЗЗ_Титул1Ссылка.Скопировать();
	НовыйОбъект.Записать();
	
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(НовыйОбъект.Ссылка, Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик, Истина);
	
	// завершаем старую
	РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.УстановитьСостояние(ЗЗ_Титул1Ссылка, "zz-createNewZZ",, Истина);
	
	Возврат НовыйОбъект.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура КомандаСтатусПодписиСертификатаМЧД(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаСтатусПодписиСертификатаМЧД(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикРазрешенияПолномочий(Параметр1, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработчикРазрешенияПолномочий(ЭтаФорма, ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументОснование(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаДокументОснование(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументаОснования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработатьВыборДокументаОснование(ВыбранноеЗначение, Объект, ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПриОчисткеДокументаОснование(ЭтаФорма, Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрицепыПриИзменении(Элемент)
	ЗаполитьПолеВводаПрицепа(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПолучателиФайлаПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПунктКолбасыНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоКолбасеКТитулу(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВторогоВодителя(Команда)
	Элементы.ГруппаВодитель2.Видимость = Истина;
	Элементы.ДобваитьВторогоВодителя.Видимость = Ложь;
КонецПроцедуры

#Область Команды

&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
    КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, РеквизитыФормы());
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция РеквизитыФормы()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.РеквизитыФормы(ЭтаФорма);
	
КонецФункции
